ucb_cs169.1x/rails-intro/app/controllers/movies_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "6"]]

  def index
    @movies = Movie.order(sort_column + " " + sort_direction)
---
SELECT "movies".* FROM "movies" ORDER BY release_date desc